Model: "Task (domain) recognition"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32)]          0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 32, 32)            0         
_________________________________________________________________
expand_last_dim (ExpandLastD (None, 32, 32, 1)         0         
_________________________________________________________________
normalization (Normalization (None, 32, 32, 1)         3         
_________________________________________________________________
conv2d (Conv2D)              (None, 30, 30, 32)        320       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12544)             0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 12544)             0         
_________________________________________________________________
dense (Dense)                (None, 3)                 37635     
_________________________________________________________________
classification_head_1 (Softm (None, 3)                 0         
=================================================================
Total params: 56,454
Trainable params: 56,451
Non-trainable params: 3
_________________________________________________________________




Model: "Single task classifier"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32)]          0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 32, 32)            0         
_________________________________________________________________
expand_last_dim (ExpandLastD (None, 32, 32, 1)         0         
_________________________________________________________________
normalization (Normalization (None, 32, 32, 1)         3         
_________________________________________________________________
conv2d (Conv2D)              (None, 30, 30, 32)        320       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12544)             0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 12544)             0         
_________________________________________________________________
dense (Dense)                (None, 1)                 12545     
_________________________________________________________________
classification_head_1 (Activ (None, 1)                 0         
=================================================================
Total params: 31,364
Trainable params: 31,361
Non-trainable params: 3
_________________________________________________________________




Model: "multi task classifier"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32)]          0         
_________________________________________________________________
cast_to_float32 (CastToFloat (None, 32, 32)            0         
_________________________________________________________________
expand_last_dim (ExpandLastD (None, 32, 32, 1)         0         
_________________________________________________________________
normalization (Normalization (None, 32, 32, 1)         3         
_________________________________________________________________
conv2d (Conv2D)              (None, 30, 30, 32)        320       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 28, 28, 64)        18496     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 14, 14, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 12544)             0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 12544)             0         
_________________________________________________________________
dense (Dense)                (None, 6)                 75270     
_________________________________________________________________
classification_head_1 (Softm (None, 6)                 0         
=================================================================
Total params: 94,089
Trainable params: 94,086
Non-trainable params: 3
_________________________________________________________________